
//=============================================================================
//
// カーゲームα処理 [AKR.h]
// Author : NARITADA SUZUKI
//
//=============================================================================


#ifndef AKR_FILE
#define AKR_FILE

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define X1 (0)	//頂点1の座標
#define X2 (200)	//頂点2の座標

#define Y1 (300)	//頂点1の座標
#define Y2 (600)	//頂点2の座標

#define AKRX1 (0)	//頂点1の座標
#define AKRX2 (180)	//頂点2の座標

#define AKRY1 (0)	//頂点1の座標
#define AKRY2 (360)	//頂点2の座標

#define AKR_SIZE_MIN (10) //対角線の最小値
#define AKR_SIZE_MAX (800)//対角線の最大値 

#define Y_SPEED (30)	//縦の加速度
#define X_SPEED (30)	//横の加速度



#define AKR_MAX (1) //先生のマックス

#define AKR1 ("data/TEXTURE/akira000.png")
#define AKR2 ("../data/TEXTURE/akira000.png")
//*****************************************************************************
// 構造体宣言
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPolygonAKR(void);//ポリゴン初期化で結果を返す
void UnInitPolygonAKR(void);//ポリゴン終了処理
void UpdatePolygonAKR(void);//ポリゴンアップデート
void DrawPolygonAKR(void);//ポリゴン描画
void UpdateROTATE();

#endif
//AKR
