//=============================================================================
//
// カーゲームα [GameBG2.cpp]
// Author : NARITADA SUZUKI
//
//=============================================================================
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "GameBG2.h"

//*****************************************************************************
// グローバル変数:
//*****************************************************************************
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//=============================================================================
// 初期化関数
//=============================================================================
void GAMEBG2IMAGE::InitGameBG2(void)//ポリゴン初期化で結果を返す
{
	this->BGBase.InitBase(-BG_X,0,0,0,BG2SIZE_WH,BG2SIZE_WH,0);
	this->BGPolygon.InitPolygon(BG2,BG2SIZE_WH,BG2SIZE_WH,BGBase.chkPosX(),BGBase.chkPosX(),1);
}
//=============================================================================
// 終了処理関数
//=============================================================================
void GAMEBG2IMAGE::UnInitGameBG2(void)//ポリゴン終了処理
{

	this->BGPolygon.UninitPolygon();

}
//=============================================================================
// アップデート関数
//=============================================================================
void GAMEBG2IMAGE::UpdateGameBG2(float nPosX)//ポリゴンアップデート
{

	this->BGBase.ChangeTex(nPosX/1900,this->BGBase.chkTexY());

	this->BGBase.ChangeTex(this->BGBase.chkTexX(),this->BGBase.chkTexY()-BG2_SPEED);
	this->BGPolygon.SetTexUV(this->BGBase.chkTexX(),this->BGBase.chkTexY(),1,1);
	this->BGPolygon.UpdatePolygon(this->BGBase.chkWitdth(),this->BGBase.chkHeight(),this->BGBase.chkPosX(),this->BGBase.chkPosY(),0);
}
//=============================================================================
// 描画関数
//=============================================================================
void GAMEBG2IMAGE::DrawGameBG2(void)//ポリゴン描画
{
	//ポリゴン表示
	this->BGPolygon.DrawPolygon(0);
}