//=============================================================================
//
// カーゲームα [GameBG3.cpp]
// Author : NARITADA SUZUKI
//
//=============================================================================
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "GameBG3.h"

//*****************************************************************************
// グローバル変数:
//*****************************************************************************
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//=============================================================================
// 初期化関数
//=============================================================================
void GAMEBG3IMAGE::InitGameBG3(void)//ポリゴン初期化で結果を返す
{
	this->BGBase.InitBase(-BG3_X,0,0,0,BG3SIZE_WH,BG3SIZE_WH,0);
	this->BGPolygon.InitPolygon(BG3,BG3SIZE_WH,BG3SIZE_WH,BGBase.chkPosX(),BGBase.chkPosX(),1);
}
//=============================================================================
// 終了処理関数
//=============================================================================
void GAMEBG3IMAGE::UnInitGameBG3(void)//ポリゴン終了処理
{

	this->BGPolygon.UninitPolygon();

}
//=============================================================================
// アップデート関数
//=============================================================================
void GAMEBG3IMAGE::UpdateGameBG3(float nPosX)//ポリゴンアップデート
{
	this->BGBase.ChangeTex(nPosX/8000,this->BGBase.chkTexY());
	this->BGBase.ChangeTex(this->BGBase.chkTexX(),this->BGBase.chkTexY()-BG3_SPEED);
	this->BGPolygon.SetTexUV(this->BGBase.chkTexX(),this->BGBase.chkTexY(),this->BGBase.chkTexX()+1,1);
	this->BGPolygon.UpdatePolygon(this->BGBase.chkWitdth(),this->BGBase.chkHeight(),this->BGBase.chkPosX(),this->BGBase.chkPosY(),0);
}
//=============================================================================
// 描画関数
//=============================================================================
void GAMEBG3IMAGE::DrawGameBG3(void)//ポリゴン描画
{
	//ポリゴン表示
	this->BGPolygon.DrawPolygon(0);
}