//=============================================================================
//
// 当たり判定管理 [HitChk.h]
// Author : NARITADA SUZUKI
//
#ifndef _HITCHK
#define _HITCHK
//=============================================================================
//インクルード
//*****************************************************************************
#include"main.h"
//=============================================================================
//マクロ定義
typedef enum
{
	CIRTOCIR=0,//円と円の判定
	CIRTOQUA,//円と四角形
	QUATOQUA//四角と四角
	
}HIT_MODE;
//=============================================================================
//クラス
//=============================================================================
class HITCHK
{
public:
	int HitChk(float nPosX1,float nPosY1,int nSizeW1,int nSizeH1,float nPosX2,float nPosY2,int nSizeW2,int nSizeH2,int nNum);//円同士の当たり判定
private:

};

#endif