//=============================================================================
//
// カーゲーム完成 [main.h]
// Author : NARITADA SUZUKI
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_
//*****************************************************************************
//事前定義
//*****************************************************************************
#define DIRECTINPUT_VERSION (0x0800)
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "d3dx9.h" //描画処理に必要
#include"dinput.h"
#include"input.h"
#include"xaudio2.h"

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

#pragma comment (lib,"d3d9.lib") //描画処理に必要
#pragma comment (lib,"d3dx9.lib") //上の拡張
#pragma comment (lib,"dxguid.lib") //directXコンポーネント使用に必要
#pragma comment (lib,"dinput8.lib")//入力に必要
#pragma comment (lib,"winmm.lib")



//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCREEN_WIDTH (960)  //横画面サイズ
#define SCREEN_HEIGHT (540) //縦画面サイズ

#define GAME_MAX_W (740)

#define FVF_VERTEX_2D (D3DFVF_XYZRHW|D3DFVF_DIFFUSE|D3DFVF_TEX1)	//頂点フォーマット(2D用)
//*****************************************************************************
// 列挙型マクロ
//*****************************************************************************
typedef enum//ゲームモード選択ええ
{
	MODE_TITLE=0,
	MODE_GAME,
	MODE_RESLUT,
	MODE_MAX
}MODE;

typedef enum 
{
	INITGAME=0,MAINGAME,POSEGAME,GAMEOVER,UNINITGAME,GAMETITLE
}MODEGAME;
enum 
{
	CHARA1_MODE,CHARA2_MODE
};

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
typedef struct{
	D3DXVECTOR3 vtx;//ポリゴン座標
	float rhw;
	D3DCOLOR diffurse;//カラー設定
	D3DXVECTOR2 tex;//テクスチャ座標
}VERTEX_2D; //頂点座標とパースと反射設定
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

LPDIRECT3DDEVICE9 GetDevice(void);//デバイス情報

void SetMode(MODE mode);//モードセット
MODE GetMode(void);//モード取得

void MODEinit(void);//モード初期化
void MODEuninit(void);//モード終了




//*****************************************************************************
#endif

