//=============================================================================
//
// カーゲームα [ResultBG.cpp]
// Author : NARITADA SUZUKI
//
//=============================================================================
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "ResultBG.h"


void RESLUTBGIMAGE::InitResultBG(void)//ポリゴン初期化で結果を返す
{

	this->BGPolygon.InitPolygon(BG1,R_W,R_H,0,0,1);
	this->BGBase.InitBase(0,0,0,0,R_W,R_H,0);
}
//=============================================================================
// 終了処理関数
//=============================================================================
void RESLUTBGIMAGE::UnInitResultBG(void)//ポリゴン終了処理
{

	this->BGPolygon.UninitPolygon();

}
//=============================================================================
// アップデート関数
//=============================================================================
void RESLUTBGIMAGE::UpdateResultBG(void)//ポリゴンアップデート
{
	this->BGPolygon.UpdatePolygon(this->BGBase.chkWitdth(),this->BGBase.chkHeight(),this->BGBase.chkPosX(),this->BGBase.chkPosY(),0);
}
//=============================================================================
// 描画関数
//=============================================================================
void RESLUTBGIMAGE::DrawResultBG(void)//ポリゴン描画
{
	//ポリゴン表示
	this->BGPolygon.DrawPolygon(0);
}