
//=============================================================================
//
// カーゲームα処理 [Result.h]
// Author : NARITADA SUZUKI
//
//=============================================================================


#ifndef RESULTLOGO_FILE
#define RESULTLOGO_FILE

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "Polygon.h"
#include "Base.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define RESLUT_X (300)
#define RESLUT_Y (20)
#define RESULT_W (200)
#define RESULT_H (50)

#define RLOGO1 ("data/TEXTURE/ResultLogo.png")
//*****************************************************************************
// 構造体宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class RESULTLOGOIMAGE
{
public:
void InitResultLogo(void);//ポリゴン初期化で結果を返す
void UnInitResultLogo(void);//ポリゴン終了処理
void UpdateResultLogo(void);//ポリゴンアップデート
void DrawResultLogo(void);//ポリゴン描画
private:
	cBase c_LogoBase;
	Poly c_LogoPolygon;

};

#endif

