
//=============================================================================
//
// カーゲームα処理 [ReslutBG.h]
// Author : NARITADA SUZUKI
//
//=============================================================================


#ifndef RESULTBG_FILE
#define RESULTBG_FILE

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "Polygon.h"
#include "Base.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define BG1 ("data/TEXTURE/Pose.png")
#define R_W (960)
#define R_H (540)

//*****************************************************************************
// クラス
//*****************************************************************************
class RESLUTBGIMAGE
{
public:
void InitResultBG(void);//ポリゴン初期化で結果を返す
void UnInitResultBG(void);//ポリゴン終了処理
void UpdateResultBG(void);//ポリゴンアップデート
void DrawResultBG(void);//ポリゴン描画
private:

	cBase BGBase;
	Poly BGPolygon;
	Poly R_Score;
};


#endif


