
//=============================================================================
//
// カーゲームα処理 [score.h]
// Author : NARITADA SUZUKI
//
//=============================================================================


#ifndef score_FILE
#define score_FILE

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "Polygon.h"
#include "Base.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCORE_X (750)	//スコア頂点の座標
#define SCORE_Y (300)	//頂点の座標

#define SCORE_W (30)		//スコアサイズ
#define SCORE_H (60) 

#define SCORE_MAX (5)	//スコアの最大値

#define SCORE1 ("data/TEXTURE/number000.png")
//*****************************************************************************
// 構造体宣言
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

class SCOREIMAGE
{
public:
void InitScore(void);//ポリゴン初期化で結果を返す
void UnInitScore(void);//ポリゴン終了処理
void UpdateScore(void);//ポリゴンアップデート
void DrawScore(void);//ポリゴン描画
void SetScoreXY(float fX,float fY);
int GetSCore(void){return c_nScoreNum;}
void AddScore(int nNum);
private:
	cBase c_ScoreBase[SCORE_MAX];
	Poly c_ScorePolygon;
	int c_nScoreNum;
};
#endif
//AKR
