
//=============================================================================
//
// カーゲームα処理 [TitleBG.h]
// Author : NARITADA SUZUKI
//
//=============================================================================


#ifndef TITLEBG_FILE
#define TITLEBG_FILE

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "Polygon.h"
#include "Base.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TBG1 ("data/TEXTURE/DXTITLE.png")
#define T_X (100)
#define TITLEBGWH (800)
//*****************************************************************************
// クラス
//*****************************************************************************
class TITLEBGIMAGE
{
public:
void InitTitleBG(void);//ポリゴン初期化で結果を返す
void UnInitTitleBG(void);//ポリゴン終了処理
void UpdateTitleBG(void);//ポリゴンアップデート
void DrawTitleBG(void);//ポリゴン描画
private:

	cBase BGBase;
	Poly BGPolygon;
};
#endif

