//=============================================================================
//
// カーゲームα [TitleBG.cpp]
// Author : NARITADA SUZUKI
//
//=============================================================================
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "TitleLogo.h"

//*****************************************************************************
// グローバル変数:
//*****************************************************************************
LPDIRECT3DTEXTURE9 g_pD3DTexTitleLogo = NULL;//テクスチャ格納変数
LPDIRECT3DVERTEXBUFFER9 g_pD3DVtxBuffTitleLogo=NULL;//頂点バッファ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//=============================================================================
// 初期化関数
//=============================================================================
void TITLELOGOIMAGE::InitTitleLogo(void)//ポリゴン初期化で結果を返す
{
	this->c_LogoBase.InitBase(TITLE_X,TITLE_Y,0,0,TITLE_W,TITLE_H,0);
	this->c_LogoPolygon.InitPolygon(TLOGO1,TITLE_W,TITLE_H,TITLE_X,TITLE_Y,1);
}
//=============================================================================
// 終了処理関数
//=============================================================================
void TITLELOGOIMAGE::UnInitTitleLogo(void)//ポリゴン終了処理
{
	this->c_LogoPolygon.UninitPolygon();
}
//=============================================================================
// アップデート関数
//=============================================================================
void TITLELOGOIMAGE::UpdateTitleLogo(void)//ポリゴンアップデート
{
	this->c_LogoPolygon.UpdatePolygon(this->c_LogoBase.chkWitdth(),this->c_LogoBase.chkHeight(),this->c_LogoBase.chkPosX(),this->c_LogoBase.chkPosY(),0);
}
//=============================================================================
// 描画関数
//=============================================================================
void TITLELOGOIMAGE::DrawTitleLogo(void)//ポリゴン描画
{
	this->c_LogoPolygon.DrawPolygon(0);
}